{
  "Header.Item1": "Acerca de mí",
  "Header.Item2": "Experiencia",
  "Header.Item3": "Proyectos",
  "Header.Item4": "Contacto",
  "Header.cvBtn": "CV",
  "Header.cvName": "cv.pdf",
  "Banner.Pretitle": "¡Hola! Mi nombre es",
  "Banner.Description": "Soy un Desarrollador Full‑Stack con <span class='underline'>3 años de experiencia</span> creando aplicaciones web escalables. Construyo <span class='underline'>frontends</span> responsivos y amigables con el usuario, especializado en crear interfaces responsivas e intuitivas usando <span class='underline'>Angular</span> y <span class='underline'>backends</span> confiables con Node.js y Go. Me enfoco en código limpio y reutilizable, aplicando prácticas modernas para entregar soluciones técnicamente sólidas y alineadas con tus necesidades empresariales.",
  "Banner.ActionBtn": "Ponte en contacto",
  "AboutMe.Title": "Acerca de mí",
  "AboutMe.Paragraphs": [
    "Durante los últimos <span class='underline'>3 años</span> como Desarrollador Full-Stack, he trabajado de extremo a extremo en aplicaciones empresariales, desarrollando <span class='underline'>APIs backend</span> y servicios con Express.js y MongoDB para construir sistemas backend robustos. Mi conjunto de herramientas incluye marcos de trabajo frontend como <span class='underline'>Angular</span> y pilas backend como <span class='underline'>Node.js, Express.js, y Go</span>",
    "Mi enfoque enfatiza sistemas escalables y mantenibles. Optimizo el rendimiento, aplico patrones reutilizables y priorizo código limpio."
  ],
  "Experience.Title": "Experiencia",
  "Experience.Jobs": [
    {
      "Tab": "Lenovo",
      "Title": "Ingeniero de Software",
      "Date": "Julio 2023 - Presente",
      "Description": [
        "Planificar y priorizar tareas del sprint o backlog; desglosar características en tickets accionables.",
        "Escribir y revisar código para sistemas frontend y backend.",
        "Implementar componentes de UI con HTML, CSS/SCSS, y JavaScript o patrones específicos del marco de trabajo como Angular.",
        "Trabajar con marcos MVC para desarrollar backends robustos y escalables.",
        "Solucionar y corregir errores e problemas en el backend y frontend para asegurar el funcionamiento fluido de las aplicaciones.",
        "Colaborar con equipos multidisciplinarios (diseñadores, gerentes de producto, QA) para alinear requisitos.",
        "Mantener mejores prácticas de seguridad y cumplimiento (validación de entrada, autenticación, manejo de secretos).",
        "Mentorar y compartir conocimiento con desarrolladores; ayudar a incorporar nuevos miembros del equipo."
      ]
    },
    {
      "Tab": "Militar",
      "Title": "Policía",
      "Date": "Septiembre 2019 - Julio 2023",
      "Description": [
        "Realizar investigaciones preliminares y de seguimiento, incluyendo recopilación de evidencia, entrevistas a testigos y documentación de reportes.",
        "Colaborar con otros oficiales, unidades especializadas y agencias externas para coordinar operaciones e intercambiar inteligencia.",
        "Mantener preparación física, conciencia situacional y adherencia a protocolos operacionales en todo momento.",
        "Preparar reportes de incidentes detallados y documentación utilizada para procedimientos legales y seguimientos de casos."
      ]
    }
  ],
  "FeatureProjects.Title": "Proyectos de los que soy/fui parte",
  "FeatureProjects.Label": "Proyecto Destacado",
  "FeatureProjects.Projects": [
    {
      "Title": "Lenovo XClarity One",
      "Description": "<span class='underline'>Lenovo XClarity One</span> es una plataforma de gestión unificada y flexible que simplifica la administración de <span class='underline'>servidores Lenovo</span>. Desplegable como una solución híbrida basada en la nube o como una máquina virtual local, proporciona una interfaz consistente e intuitiva para monitorear, gestionar y optimizar la infraestructura del centro de datos.",
      "imgs": ["assets/images/xc1/image1.png", "assets/images/xc1/image2.png"],
      "demoLink": "https://www.lenovo.com/ro/ro/servers-storage/software/xclarityone/?srsltid=AfmBOor00-sIgG6gO4vbU1VpV23Gw7aE44jBlIbAzQoIMpZlMqnk-Q8L"
    },
    {
      "Title": "Lenovo XClarity One Hub",
      "Description": "<span class='underline'>Los Hubs</span> son gestores de dispositivos ligeros que actúan como un puente seguro entre el portal <span class='underline'>Lenovo XClarity One</span> y tus dispositivos locales. Los hubs son los únicos dispositivos que se comunican directamente con <span class='underline'>XClarity One</span>.",
      "imgs": ["assets/images/hub/image1.png", "assets/images/hub/image2.png"],
      "demoLink": "https://support.lenovo.com/us/en/solutions/ht516467-lenovo-xclarity-management-hub-20"
    },
    {
      "Title": "Lenovo XClarity Orchestrator",
      "Description": "<span class='underline'>Lenovo XClarity Orchestrator</span> proporciona monitoreo centralizado, gestión, aprovisionamiento y análisis para entornos con grandes cantidades de dispositivos. Aprovecha gestores de recursos existentes (como <span class='underline'>Lenovo XClarity Administrator</span> y Schneider Electric EcoStruxure IT Expert) en múltiples sitios para ver la salud general, recopilar inventario de dispositivos y resúmenes de salud, profundizar en detalles del dispositivo, ver registros de eventos y auditoría, y aplicar actualizaciones a recursos gestionados.",
      "imgs": [
        "assets/images/lxco/image1.png",
        "assets/images/lxco/image2.png"
      ],
      "demoLink": "https://pubs.lenovo.com/lxco/lxco-overview"
    }
  ],
  "OtherProjects.Title": "Más proyectos personales",
  "OtherProjects.Projects": [
    {
      "Title": "HamburgerStore",
      "Description": "HamburgerStore es un restaurante que se adapta al gusto de cada cliente. Aquí están las hamburguesas más deliciosas jamás hechas. Desde nuestro amor por la cocina pero también el deseo de ofrecer servicios de calidad, nuestro restaurante de comida rápida es una excelente opción",
      "ghLink": "https://github.com/jucastefan/hamburgerstore",
      "demoLink": "http://hamburgerstore.pages.dev/",
      "Technologies": ["React", "CSS", "HTML5", "Bootstrap", "Firebase"]
    },
    {
      "Title": "SushiShop",
      "Description": "Sushi Shop es el lujo definitivo y un plato más comúnmente asociado con Japón. Se puede hacer de muchas formas diferentes usando muchos ingredientes diferentes, hay algo para todos. Aprende cómo hacer sushi y descubre qué otros ingredientes puedes usar",
      "ghLink": "https://github.com/jucastefan/sushishop",
      "demoLink": "https://scintillating-gaufre-ad6c20.netlify.app/",
      "Technologies": ["React", "CSS", "HTML5", "Firebase"]
    },
    {
      "Title": "ArtOnCanvas",
      "Description": "Tiene diferentes funcionalidades incluyendo Iniciar Sesión, Registrarse, Carrito de Compras, Realizar Pedido, Perfil de Usuario (una persona puede cambiar su nombre o correo electrónico si lo desea) y Pedido de Envío. El Back-end está representado por un Servidor Node.js y una Base de Datos, ambos desplegados en Heroku.",
      "ghLink": "https://github.com/jucastefan/artoncanvas",
      "demoLink": "https://artoncanvas.pages.dev/",
      "Technologies": ["JavaScript", "Node.js", "Bootstrap", "HTML5", "CSS"]
    },
    {
      "Title": "ProjectUploader",
      "Description": "Todos necesitamos una mano amiga. Para mí, ProjectUploader es la herramienta ideal para ayudarem a almacenar proyectos en la base de datos de mi portafolio. La idea de este proyecto se me ocurrió mientras estaba rellenando la base de datos y pensé que no sería malo ponerlo en práctica",
      "ghLink": "https://github.com/jucastefan/projectuploader",
      "demoLink": "https://projectuploader.netlify.app/",
      "Technologies": ["React", "CSS", "HTML5", "Bootstrap", "Firebase"]
    }
  ],
  "Contact.Pretitle": "¿Qué sigue?",
  "Contact.Title": "¡Ponte en contacto!",
  "Contact.Content": "Me encantaría conectar si te interesa discutir nuevas oportunidades. Siéntete libre de contactarme—responderé tan pronto como vea tu mensaje. Este es un diseño limpio de una página que muestra un breve perfil y detalles personales esenciales.",
  "Contact.Btn": "Enviar Saludo"
}
